# Local Variables:
# org-confirm-babel-evaluate: nil
# eval: (add-hook 'after-save-hook (lambda ()(org-babel-tangle)) nil t)
# End:

** Org ref
Manage references using org-ref.
#+begin_src elisp
(after! org
  (setq reftex-default-bibliography "/home/eethern/Dropbox/bibliography/references.bib")
  (setq org-ref-bibliography-notes "~/Dropbox/bibliography/notes.org"
        org-ref-default-bibliography (list "/home/eethern/Dropbox/bibliography/references.bib")
        org-ref-pdf-directory "~/Dropbox/bibliography/bibtex-pdfs/")

  (setq org-ref-completion-library 'org-ref-ivy-cite)
  (map! :map org-mode-map :localleader
        :desc "Insert org-ref reference link"
        "l r" 'org-ref-insert-ref-link)

                                        ; Makes org-ref reload its completion on save rather than just on buffer reload
  (add-hook 'after-save-hook (lambda ()
                               (setq org-ref-labels nil))))
#+end_src

#+RESULTS:
| (lambda nil (setq org-ref-labels nil)) | (closure (t) nil (setq org-ref-labels nil)) | rmail-after-save-hook | doom-modeline-update-vcs-text | doom-modeline-update-vcs-icon | doom-modeline-update-buffer-file-name | +upload-init-after-save-h | +evil-display-vimlike-save-message-h | doom-auto-revert-buffers-h | doom-guess-mode-h |

** Org roam
I transferred to org-roam after I realized I hated hierarchical documents. Ideas
apply to many different subjects, which org-roam handles very well. This block
setups org-roam and enables it.
#+begin_src elisp
(after! org-roam
  (setq org-roam-directory "~/Dropbox/org/org-roam")
  (set-company-backend! 'org-mode '(company-org-roam company-yasnippet company-dabbrev)))
#+end_src

Setup capture templates for org-roam. I made these load from template files for faster editing.
#+begin_src elisp
(after! org-roam
  (setq org-roam-capture-templates
        '(("l" "latex")
          ("ld" "temporary note" plain (function org-roam-capture--get-point)
           (file "/home/eethern/.doom.d/templates/draft.org")
           :file-name "draft/%<%Y%m%d%H%M%S>-${slug}"
           :unnarrowed t)
          ("ll" "permanent note" plain (function org-roam-capture--get-point)
           (file "/home/eethern/.doom.d/templates/latex.org")
           :file-name "%<%Y%m%d%H%M%S>-${slug}"
           :unnarrowed t)
          ("la" "assignment" plain (function org-roam-capture--get-point)
           (file "/home/eethern/.doom.d/templates/latex.org")
           :file-name "assignment/%<%Y%m%d%H%M%S>-${slug}"
           :unnarrowed t)
          ("le" "exercise" plain (function org-roam-capture--get-point)
           (file "/home/eethern/.doom.d/templates/exercise.org")
           :file-name "exercise/%<%y%m%d%h%m%s>-${slug}"
           :unnarrowed t)
          ("p" "project" plain (function org-roam-capture--get-point)
           (file "/home/eethern/.doom.d/templates/project.org")
           :file-name "project/${slug}/README"
           :unnarrowd t)
           )
          )
        )
#+end_src


And for dailies
#+begin_src elisp
(after! org-roam
  (setq org-roam-dailies-capture-templates
        '(("d" "default" entry
           #'org-roam-capture--get-point
           "* %?"
           :file-name "daily/%<%Y-%m-%d>"
           :head "#+title: %<%Y-%m-%d>\n\n#+ROAM_TAGS: Dailies\n"
           ))))
#+end_src

The following comands handles exporting backlinks to html. They will appear at the top of the document.
#+begin_src elisp
;; (after! (org-roam)
;;   (defun eethern/org-roam-export-all ()
;;     "Re-exports all Org-roam files to HTML"
;;     (interactive)
;;     (dolist (f (org-roam--list-all-files))
;;       (with-current-buffer (find-file f)
;;         (when (s-contains? "SETUPFILE" (buffer-string))
;;           (org-html-export-to-html)))))
;;   (defun eethern/org-roam--backlinks-list (file)
;;     (when (org-roam--org-roam-file-p file)
;;       (mapcar #'car (org-roam-db-query [:select :distinct [from]
;;                                         :from links
;;                                         :where (= to $s1)
;;                                         :and from :not :like $s2] file "%private%"))))
;;   (defun eethern/org-export-preprocessor (_backend)
;;     (when-let ((links (eethern/org-roam--backlinks-list (buffer-file-name))))
;;       (insert "\n** Backlinks\n")
;;       (dolist (link links)
;;         (insert (format "- [[file:%s][%s]]\n"
;;                         (file-relative-name link org-roam-directory)
;;                         (org-roam--get-title-or-slug link))))))
;;   (add-hook 'org-export-before-processing-hook #'eethern/org-export-preprocessor))
#+end_src

Setup org roam server. This does some nice styling and physics simulations to
make the graph view much nicer.
#+begin_src elisp
(setq org-roam-server-network-vis-options "{
    \"physics\": {
        \"enabled\": true,
        \"stabilization\": {
            \"enabled\": true,
            \"iterations\": 10000
        },
        \"timestep\": 0.4,
        \"maxVelocity\": 100,
        \"solver\": \"barnesHut\",
        \"barnesHut\": {
            \"theta\": 0.5,
            \"gravitationalConstant\": -2000,
            \"centralGravity\": 20,
            \"springLength\": 100,
            \"springConstant\": 0.1,
            \"damping\": 0.8,
            \"avoidOverlap\": 0
        }
    },
    \"edges\": {
        \"physics\": true,
        \"length\": 5,
        \"hidden\": false,
        \"smooth\": {
            \"enabled\": true,
            \"type\": \"continuous\"
        },
        \"color\": {
            \"border\": \"#2B7CE9\",
            \"background\": \"#97C2FC\",
            \"highlight\": \"#6f5ecc\",
            \"hover\": \"#6f5ecc\"
        }
    },
    \"nodes\": {
        \"mass\": 15,
        \"font\": {
            \"size\": 24
        },
        \"color\": {
            \"border\": \"#D6D5D3\",
            \"background\": \"#ffffff\",
            \"highlight\": \"#6f5ecc\",
            \"hover\": \"#6f5ecc\"
        }
    },
    \"options\": {
        \"highlightNearest\": {
            \"enable\": true,
            \"degree\": 2
        }
    }
}")
#+end_src

#+RESULTS:
#+begin_example
{
    "physics": {
        "enabled": true,
        "stabilization": {
            "enabled": true,
            "iterations": 10000
        },
        "timestep": 0.4,
        "maxVelocity": 100,
        "solver": "barnesHut",
        "barnesHut": {
            "theta": 0.5,
            "gravitationalConstant": -2000,
            "centralGravity": 20,
            "springLength": 100,
            "springConstant": 0.1,
            "damping": 0.8,
            "avoidOverlap": 0
        }
    },
    "edges": {
        "physics": true,
        "length": 5,
        "hidden": false,
        "smooth": {
            "enabled": true,
            "type": "continuous"
        },
        "color": {
            "border": "#2B7CE9",
            "background": "#97C2FC",
            "highlight": "#6f5ecc",
            "hover": "#6f5ecc"
        }
    },
    "nodes": {
        "mass": 15,
        "font": {
            "size": 24
        },
        "color": {
            "border": "#D6D5D3",
            "background": "#ffffff",
            "highlight": "#6f5ecc",
            "hover": "#6f5ecc"
        }
    },
    "options": {
        "highlightNearest": {
            "enable": true,
            "degree": 2
        }
    }
}
#+end_example

*** Bibliography
Setup org-roam-bibtex
#+begin_src elisp
(use-package! org-roam-bibtex
  :after org-roam
  :hook (org-roam-mode . org-roam-bibtex-mode)
  :config
  (require 'org-ref)) ; optional: if Org Ref is not loaded anywhere else, load it here
#+end_src



  #+RESULTS:
  | org-roam-bibtex-mode |

